---
layout: post
title:  "沉默的程序员"
date:   2015-10-31
categories: blog
---

我发现这儿，大部分程序员都是不出声的。他们来了，走了，默默的，没有存在感。沟通仅限在聊天工具上，刷刷的，让你觉得并不是他们不需要表达，而是方式和途径颇为与众不同。

我把这种现象，称之为「文化荒漠」。

这儿没有老板定期的一对一谈心，没有软技能培训，没有团队内技术分享，没有代码审查会上的争论，没有流程传达与控制。这儿有的是，高级工程师把控决策，解决难题；普通工程师按部就班，添砖加瓦。仔细想一想，为什么会这样呢？用流行的话说，就是「然并卵」。

所谓文化，说白了其实是提升团队凝聚力的手段，俗称「洗脑」。别看前东家高大上，谁都知道它致命的弱点是缺钱。于是对文化的标榜，到了无所不用其极的地步。它们把一队小伙伴们组织起来，提供先进的工具和理论，划定界限和游戏规则，让参与者自得其乐，像是圈养的羊。

而在这儿，大伙就像放养的狼：孤独，自食其力。奇怪的是，这样的管理，简单却有成效。激励团队的手段也不需要费力的「走心」了，拿钱砸就行。这儿人员的流动也是惊人的，所以搞文化那一套行不通。

你问我适合哪一种环境？我会告诉你我是集众家之长的。光是有效沟通和即兴演讲这两项技能就秒杀这儿所有沉默的程序员。

技术工作者往上走，都会进入提升影响力，跨界，研究人文、哲学这条不归路。沉默惯了，在需要时，真的连开口说话都不会了。年初的时候，我引用过名人名言「Talk is cheap. Show me the code.」现在看来，这是沉默程序员们的自我麻醉，也是管理层的慢性毒药。说这句话的林努斯何等人样，吵架从来没有输过的好吧。



