---
layout: post
title:  "重温 SSL"
date:   2015-03-14
categories: blog
---

隔了很长一段时间才更新博客。

今天是二宝出生满月的日子。跟大宝比起来，这小家伙一路走来可以说是一波三折。

本篇的主旨是 SSL （准确的说，现在是 TLS）每次在项目里要用到这个东西，都得查资料。因为它并不常用。

SSL 最广泛的一种使用场景是 HTTPS。其次就是 SSH。

两者本质的区别在于，前者引入了第三方，也就是 Certificate authority （CA）来解决客户端和服务器互信的问题；后者没有第三方。因为 SSH server 是用户能完全控制的。

这次重温 SSL 是为了给开发团队做讲座。我顺便将相关知识整理成文：
[SSL Revisit](http://slides.com/homerhuang/ssl)

* 讲座只起到提点作用，想要深入理解还要课后自学。学习内容的链接已经包括在讲义里了。
* 讲义里有一个详细的服务器证书制作过程。理解之后就能举一反三。
* 附上两个具体使用场景：双向认证和服务器发起的 HTTPS 请求。实践验证可以当作课后练习。

讲座还有另外一些内容，是 WebLogic 相关一些 Java EE 知识的科普。平心而论，我做这个主题的心情真复杂。

* 面对这种过气的服务器，我不得不深挖相关文档来备课；
* 范围超出了我现在的工作职责和研究领域；
* 没有特别值得称道的东西，花点时间都能 Google 到；我的心情跟[这个](http://www.weibo.com/p/1001603796313023084296)写的一样。
* 向我要求这个讲座的人评上了优秀员工，我却没有，TMD 我应该用一种什么心态去给他做演讲？！

最后，附上我的 [WebLogic 科普讲义](https://slides.com/homerhuang/weblogic-misc)。

